docs/comp-sci/doc-generator.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Documentation Generator</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Documentation Generator</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-6486c44a-1561-440e-a6bc-60e918ec29ab">1. Introduction</a></li>
<li><a href="#h-e1e4d1f9-3121-4de4-a134-aeb211cfce8b">2. Intent for Programs</a></li>
<li><a href="#h-f7ae7610-74c5-4464-b364-eb65bbd1f304">3. For proof assistants</a></li>
<li><a href="#h-d1788d97-eb8b-4649-8fff-2da0e8566dcc">4. References and examples</a></li>
</ul>
</div>
</div>
<div id="outline-container-h-6486c44a-1561-440e-a6bc-60e918ec29ab" class="outline-2">
<h2 id="h-6486c44a-1561-440e-a6bc-60e918ec29ab"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-h-6486c44a-1561-440e-a6bc-60e918ec29ab">
<p>
The idea of documentation generators seem to date back to 1995 with
Javadoc.
</p>

<p>
The basic idea is that "special" comments will generate HTML (or PDF
or&#x2026;) documentation files when processed by a documentation generator.
</p>

<p>
Originally, Javadoc was motivated by placing this documentation on the
"World Wide Web". Therefore, using HTML in the comments was an obvious
design decision.
</p>

<p>
However, it seems we now realize&#x2026;that's not the best idea. The general
consensus appears to have rallied around using Markdown for the
documentation comments.
</p>

<p>
In short, the basic ingredients:
</p>

<ul class="org-ul">
<li>Some way to demarcate a comment as a documentation comment. Javadoc
uses <code>/** ... */</code>, and this seems to be a common convention.</li>
<li>A choice of markup for the content of the documentation comment. This
is usually some flavor of Markdown, but Javadoc's shadow looms large
even today.
<ul class="org-ul">
<li>Consider how you'll link to other identifiers. I've seen some
Markdown systems use <code>[`identifier`]</code> (the identifier surrounded by
backticks within square brackets)</li>
</ul></li>
<li>A program to read a source file, seek out the documentation comments,
and determine what it is documenting exactly.</li>
</ul>
</div>
</div>
<div id="outline-container-h-e1e4d1f9-3121-4de4-a134-aeb211cfce8b" class="outline-2">
<h2 id="h-e1e4d1f9-3121-4de4-a134-aeb211cfce8b"><span class="section-number-2">2.</span> Intent for Programs</h2>
<div class="outline-text-2" id="text-h-e1e4d1f9-3121-4de4-a134-aeb211cfce8b">
<p>
The intent of a documentation comment is to document the API, the
contract for the function (or class or whatever).
</p>

<p>
<b>It is not literate programming.</b>
</p>

<p>
It's the quickest way to say to another programmer, "Here's how to use
this function."
</p>
</div>
</div>
<div id="outline-container-h-f7ae7610-74c5-4464-b364-eb65bbd1f304" class="outline-2">
<h2 id="h-f7ae7610-74c5-4464-b364-eb65bbd1f304"><span class="section-number-2">3.</span> For proof assistants</h2>
<div class="outline-text-2" id="text-h-f7ae7610-74c5-4464-b364-eb65bbd1f304">
<p>
With proof assistants, the usefulness of documentation comments is to
communicate the "subjective substratum" &#x2014; the informal discussions of
motivation, analogies, problems, examples, intuitions, false leads, etc.
</p>

<p>
This plays a very different role than in a program. But it is very
important.
</p>

<p>
Without these, a proof script lacks "texture" (as linguists would call
it): it's just a grocery list of propositions.
</p>
</div>
</div>
<div id="outline-container-h-d1788d97-eb8b-4649-8fff-2da0e8566dcc" class="outline-2">
<h2 id="h-d1788d97-eb8b-4649-8fff-2da0e8566dcc"><span class="section-number-2">4.</span> References and examples</h2>
<div class="outline-text-2" id="text-h-d1788d97-eb8b-4649-8fff-2da0e8566dcc">
<ul class="org-ul">
<li><a href="https://third-bit.com/sdxjs/doc-generator/">Implementing a Documentation Generator for Javascript</a></li>
<li><a href="https://package.elm-lang.org/help/documentation-format#:~:text=A%20documentation%20comment%20starts%20%7B%2D%7C,typical%20use%20of%20the%20function">Elm's doc comment conventions</a></li>
<li><a href="https://ocaml.org/manual/5.2/ocamldoc.html">ocamldoc</a> for a different take</li>
<li><a href="https://rosettacode.org/wiki/Documentation">Rosetta Code comparison</a> of doc comment conventions</li>
<li><a href="https://peps.python.org/pep-0257/">PEP-257</a> for docstring conventions in Python</li>
<li><a href="https://openjdk.org/jeps/467">JEP-467</a> for proposal of Markdown documentation comments in Java</li>
<li>Ashn's <a href="https://www.ashn.dev/blog/2020-01-21-creating-cdoc-part-1.html">Crafting Cdoc</a> blog post series</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Tue, 5 Nov 2024 09:01:07 -0800
</div>
</body>
</html>
